app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    @customers = Customer.paginate(:page => params[:page], :per_page => 20)

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @customer = Customer.find(params[:id])

INSERT INTO "customers" ("created_at", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 15 Nov 2013 21:08:13 UTC +00:00], ["first_name", "First Name"], ["last_name", "Last Name"], ["updated_at", Fri, 15 Nov 2013 21:08:13 UTC +00:00]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

UPDATE "customers" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "customers"."id" = 2  [["first_name", "first name"], ["last_name", "last name"], ["updated_at", Fri, 15 Nov 2013 20:46:27 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_customer
      @customer = Customer.find(params[:id])