app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.paginate(:page => params[:page], :per_page => 20)

INSERT INTO "items" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 27 Nov 2013 09:17:31 UTC +00:00], ["description", ""], ["name", "Khs bike"], ["updated_at", Wed, 27 Nov 2013 09:17:31 UTC +00:00]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

SELECT "items".* FROM "items" WHERE (name LIKE NULL)
---
  def search
    # @items =  Item.where(["name LIKE :tag", {:tag => params[:search][:item_name]}])
    @items =  Item.find(:all, :conditions => ['name LIKE ?', "%#{params[:search][:item_name]}%"])