app/controllers/sales_controller.rb

INSERT INTO "sales" ("comments", "created_at", "updated_at") VALUES (?, ?, ?)  [["comments", ""], ["created_at", Fri, 15 Nov 2013 20:29:53 UTC +00:00], ["updated_at", Fri, 15 Nov 2013 20:29:53 UTC +00:00]]
---
  def create
    @sale = Sale.new(sale_params)

    respond_to do |format|
      if @sale.save