app/controllers/sales_controller.rb

SELECT "sales".* FROM "sales"
---
  def index
    @sales = Sale.paginate(:page => params[:page], :per_page => 20, :order => 'id DESC')

SELECT "items".* FROM "items" WHERE (name LIKE '%%') LIMIT 3
---
  def update_line_item_options
    set_sale
    populate_items
    @available_items = Item.find(:all, :conditions => ['name ILIKE ? AND published = true OR description ILIKE ? AND published = true OR sku ILIKE ? AND published = true', "%#{params[:search][:item_name]}%", "%#{params[:search][:item_name]}%", "%#{params[:search][:item_name]}%"], :limit => 5)

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_sale
      if @sale.blank?
        if params[:sale_id].blank?
          if params[:search].blank?
            @sale = Sale.find(params[:id])