app/views/sales/_form.html.erb


          <% if @sale.items.blank? %>
---
SELECT "items".* FROM "items" INNER JOIN "line_items" ON "items"."id" = "line_items"."item_id" WHERE "line_items"."sale_id" = ?  [["sale_id", 4]]